ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.h
/*
 * stm32f4_can_LL.h
 *
 *  Created on: Jul 3, 2024
 *      Author: dell
 */

#ifndef STM32F4_CAN_LL_H_
#define STM32F4_CAN_LL_H_
/*Header LIB*/

#include <stdint.h>
#include <stdio.h>
#include "stm32f4xx.h"
/*---------------------------------*/


/*---------------------------------*/
/*Controller Area Network TxMailBox*/
typedef struct
{
  volatile uint32_t TIR;  /*!< CAN TX mailbox identifier register */
  volatile uint32_t TDTR; /*!< CAN mailbox data length control and time stamp register */
  volatile uint32_t TDLR; /*!< CAN mailbox data low register */
  volatile uint32_t TDHR; /*!< CAN mailbox data high register */
} LL_CAN_TxMailBox_TypeDef_t;

/*Controller Area Network FIFOMailBox*/
typedef struct
{
  volatile uint32_t RIR;  /*!< CAN receive FIFO mailbox identifier register */
  volatile uint32_t RDTR; /*!< CAN receive FIFO mailbox data length control and time stamp register */
  volatile uint32_t RDLR; /*!< CAN receive FIFO mailbox data low register */
  volatile uint32_t RDHR; /*!< CAN receive FIFO mailbox data high register */
} LL_CAN_FIFOMailBox_TypeDef_t;

/* Controller Area Network FilterRegister*/
typedef struct
{
  volatile uint32_t FR1; /*!< CAN Filter bank register 1 */
  volatile uint32_t FR2; /*!< CAN Filter bank register 1 */
} CAN_FilterRegister_TypeDef_t;

/*CAN control registers*/
typedef struct
{
  volatile uint32_t CAN_MCR;                            // CAN master control register              Address offset: 0x00
  volatile uint32_t CAN_MSR;                            // CAN master status register               Address offset: 0x04
  volatile uint32_t CAN_TSR;                            // CAN transmit status register             Address offset: 0x08
  volatile uint32_t CAN_RF0R;                           // CAN receive FIFO 0 register              Address offset: 0x0C
  volatile uint32_t CAN_RF1R;                           // CAN receive FIFO 1 register              Address offset: 0x10
  volatile uint32_t CAN_IER;                            // CAN interrupt enable register (CAN_IER)  Address offset: 0x14
  volatile uint32_t CAN_ESR;                            // CAN error status register                Address offset: 0x18
  volatile uint32_t CAN_BTR;                            // CAN bit timing register                  Address offset: 0x1C
  uint32_t CAN_RESERVED0[88];                           // Reserved, 0x020 - 0x17F
  LL_CAN_TxMailBox_TypeDef_t sTxMailBox[3];             // CAN Tx MailBox,                          Address offset: 0x180 - 0x1AC
  LL_CAN_FIFOMailBox_TypeDef_t sFIFOMailBox[2];         // CAN FIFO MailBox,                        Address offset: 0x1B0 - 0x1CC
  uint32_t CAN_RESERVED1[12];                           // Reserved, 0x1D0 - 0x1FF
  volatile uint32_t CAN_FMR;                            // CAN filter master register,              Address offset: 0x200
  volatile uint32_t CAN_FM1R;                           // CAN filter mode register,                Address offset: 0x204
  uint32_t CAN_RESERVED2;                               // Reserved, 0x208
  volatile uint32_t CAN_FS1R;                           // CAN filter scale register,               Address offset: 0x20C
  uint32_t CAN_RESERVED3;                               // Reserved, 0x210
  volatile uint32_t CAN_FFA1R;                          // CAN filter FIFO assignment register,     Address offset: 0x214
  uint32_t CAN_RESERVED4;                               // Reserved, 0x218
  volatile uint32_t CAN_FA1R;                           // CAN filter activation register,          Address offset: 0x21C
  uint32_t CAN_RESERVED5[8];                            // Reserved, 0x220-0x23F
  CAN_FilterRegister_TypeDef_t CAN_sFilterRegister[28]; // CAN Filter Register,                     Address offset: 0x240-0x31C
} CAN_TypeDef_t;

/* CAN base address*/
#define _CAN1_REG_BASE ((CAN_TypeDef_t *)0x40006400UL)
#define _CAN2_REG_BASE ((CAN_TypeDef_t *)0x40006800UL)

#define DISABLE 0
#define ENABLE 1

/*CAN function state structure definition*/
typedef struct
{
  uint8_t TimeTriggeredMode : 1; /*!< Enable or disable the time triggered communication mode.
                                         This parameter can be set to ENABLE or DISABLE. */

  uint8_t AutoBusOff : 1; /*!< Enable or disable the automatic bus-off management.
                                  This parameter can be set to ENABLE or DISABLE. */

  uint8_t AutoWakeUp : 1; /*!< Enable or disable the automatic wake-up mode.
                                  This parameter can be set to ENABLE or DISABLE. */

  uint8_t AutoRetransmission : 1; /*!< Enable or disable the non-automatic retransmission mode.
                                          This parameter can be set to ENABLE or DISABLE. */

  uint8_t ReceiveFifoLocked : 1; /*!< Enable or disable the Receive FIFO Locked mode.
                                         This parameter can be set to ENABLE or DISABLE. */

  uint8_t TransmitFifoPriority : 1; /*!< Enable or disable the transmit FIFO priority.
                                            This parameter can be set to ENABLE or DISABLE. */
} __attribute__((packed)) FunctionalState_t;

/*CAN MODE structure definition*/
typedef enum
{
  _NORMAL_MODE,
  _LOOPBACK_MODE,
  _SILENT_MODE,
  _SILENT_LOOPBACK_MODE

} LL_CAN_MODE_t;

/*CAN init structure definition*/
typedef struct
{
  uint32_t Prescaler; /*!< Specifies the length of a time quantum.
                         This parameter must be a number between Min_Data = 1 and Max_Data = 1024. */

  uint32_t SyncJumpWidth; /*!< Specifies the maximum number of time quanta the CAN hardware
                             is allowed to lengthen or shorten a bit to perform resynchronization.
                             This parameter can be a value of @ref _CAN_synchronisation_jump_width */

  uint32_t TimeSeg1; /*!< Specifies the number of time quanta in Bit Segment 1.
                          This parameter can be a value of @ref _CAN_time_quantum_in_bit_segment_1 */

  uint32_t TimeSeg2; /*!< Specifies the number of time quanta in Bit Segment 2.
                          This parameter can be a value of @ref _CAN_time_quantum_in_bit_segment_2 */

