ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.h
  LL_CAN_MODE_t Mode; /* Specifies can mode: normal, loopback, silent or silent loopback*/

  FunctionalState_t status; /* status of function for can */

} LL_CAN_InitTypeDef_t;

/*CAN init structure definition*/
typedef enum
{
  _CAN1,
  _CAN2
} LL_CAN_TypeDef_t;

/*CAN Handler structure*/
typedef struct
{
  LL_CAN_TypeDef_t Instance;
  LL_CAN_InitTypeDef_t Init;
  volatile uint32_t ErrorCode;

} LL_CAN_Handler_t;
/*CAN filter configuration structure definition*/
typedef struct
{

  uint32_t FilterIdHigh; /*!< Specifies the filter identification number (MSBs for a 32-bit
                          configuration, first one for a 16-bit configuration).
                          This parameter must be a number between
                          Min_Data = 0x0000 and Max_Data = 0xFFFF. */

  uint32_t FilterIdLow; /*!< Specifies the filter identification number (LSBs for a 32-bit
                             configuration, second one for a 16-bit configuration).
                             This parameter must be a number between
                             Min_Data = 0x0000 and Max_Data = 0xFFFF. */

  uint32_t FilterMaskIdHigh; /*!< Specifies the filter mask number or identification number,
                                  according to the mode (MSBs for a 32-bit configuration,
                                  first one for a 16-bit configuration).
                                  This parameter must be a number between
                                  Min_Data = 0x0000 and Max_Data = 0xFFFF. */

  uint32_t FilterMaskIdLow; /*!< Specifies the filter mask number or identification number,
                                 according to the mode (LSBs for a 32-bit configuration,
                                 second one for a 16-bit configuration).
                                 This parameter must be a number between
                                 Min_Data = 0x0000 and Max_Data = 0xFFFF. */

  uint32_t FilterFIFOAssignment; /*!< Specifies the FIFO (0 or 1U) which will be assigned to the filter.
                                      This parameter can be a value of @ref _CAN_filter_FIFO */

  uint32_t FilterBank; /*!< Specifies the filter bank which will be initialized.
                            For single CAN instance(14 dedicated filter banks),
                            this parameter must be a number between Min_Data = 0 and Max_Data = 13.
                            For dual CAN instances(28 filter banks shared),
                            this parameter must be a number between Min_Data = 0 and Max_Data = 27. */

  uint32_t FilterMode; /*!< Specifies the filter mode to be initialized.
                            This parameter can be a value of @ref _CAN_filter_mode */

  uint32_t FilterScale; /*!< Specifies the filter scale.
                             This parameter can be a value of @ref _CAN_filter_scale */

  uint32_t FilterActivation; /*!< Enable or disable the filter.
                                  This parameter can be a value of @ref _CAN_filter_activation */

  uint32_t SlaveStartFilterBank; /*!< Select the start filter bank for the slave CAN instance.
                                      For single CAN instances, this parameter is meaningless.
                                      For dual CAN instances, all filter banks with lower index are assigned to master
                                      CAN instance, whereas all filter banks with greater index are assigned to slave
                                      CAN instance.
                                      This parameter must be a number between Min_Data = 0 and Max_Data = 27. */

} LL_CAN_FilterTypeDef_t;

/*CAN Tx message header structure definition*/
typedef struct
{
  uint32_t StdId; /*!< Specifies the standard identifier.
                       This parameter must be a number between Min_Data = 0 and Max_Data = 0x7FF. */

  uint32_t ExtId; /*!< Specifies the extended identifier.
                       This parameter must be a number between Min_Data = 0 and Max_Data = 0x1FFFFFFF. */

  uint32_t _IDE; /*!< Specifies the type of identifier for the message that will be transmitted.
                     This parameter can be a value of @ref _CAN_identifier_type */

  uint32_t _RTR; /*!< Specifies the type of frame for the message that will be transmitted.
                     This parameter can be a value of @ref _CAN_remote_transmission_request */

  uint32_t _DLC; /*!< Specifies the length of the frame that will be transmitted.
                     This parameter must be a number between Min_Data = 0 and Max_Data = 8. */

  FunctionalState TransmitGlobalTime; /*!< Specifies whether the timestamp counter value captured on start
                          of frame transmission, is sent in DATA6 and DATA7 replacing pData[6] and pData[7].
                          @note: Time Triggered Communication Mode must be enabled.
                          @note: DLC must be programmed as 8 bytes, in order these 2 bytes are sent.
                          This parameter can be set to ENABLE or DISABLE. */

} LL_CAN_TxHeaderTypeDef_t;

/*CAN Rx message header structure definition*/
typedef struct
{
  uint32_t StdId; /*!< Specifies the standard identifier.
                       This parameter must be a number between Min_Data = 0 and Max_Data = 0x7FF. */

  uint32_t ExtId; /*!< Specifies the extended identifier.
                       This parameter must be a number between Min_Data = 0 and Max_Data = 0x1FFFFFFF. */

  uint32_t _IDE; /*!< Specifies the type of identifier for the message that will be transmitted.
                     This parameter can be a value of @ref _CAN_identifier_type */

  uint32_t _RTR; /*!< Specifies the type of frame for the message that will be transmitted.
                     This parameter can be a value of @ref _CAN_remote_transmission_request */

  uint32_t _DLC; /*!< Specifies the length of the frame that will be transmitted.
                     This parameter must be a number between Min_Data = 0 and Max_Data = 8. */

  uint32_t Timestamp; /*!< Specifies the timestamp counter value captured on start of frame reception.
                          @note: Time Triggered Communication Mode must be enabled.
                          This parameter must be a number between Min_Data = 0 and Max_Data = 0xFFFF. */

