ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.h
  uint32_t FilterMatchIndex; /*!< Specifies the index of matching acceptance filter element.
                          This parameter must be a number between Min_Data = 0 and Max_Data = 0xFF. */

} LL_CAN_RxHeaderTypeDef_t;

/**---------------------------------Define bit position of can register-------------------------------------------------**/
//

// Bit position of CAN_BTR register
#define SILM (31U)
#define LBKM (30U)
#define SJW (24U)
#define TS2 (20U)
#define TS1 (16U)
#define BRP (0U)

// Bit position of CAN_MCR register
#define DBF (16U)
#define RESET (15U)
#define TTCM (7U)
#define ABOM (6U)
#define AWUM (5U)
#define NART (4U)
#define RFLM (3U)
#define TXFP (2U)
#define SLEEP (1U)
#define INRQ (0U)

// Bit position of CAN_MSR register
#define INAK (0U)
#define SLAK (1U)
#define ERRI (2U)
#define WKUI (3U)
#define SLAKI (4U)
#define TXM (8U)
#define RXM (9U)
#define SAMP (10)
#define RX (11U)

// Bit position of CAN_FMR register
#define CAN2SB (8U)
#define FINIT (0U)

// Bit position of CAN_TSR register
#define LOW2 (31U)
#define LOW1 (30U)
#define LOW0 (29U)
#define TME2 (28U)
#define TME1 (9U)
#define TME0 (26U)
#define CODE (24U)
#define ABRQ2 (23U)
#define TERR2 (19U)
#define ALST2 (18U)
#define TXOK2 (17U)
#define RQCP2 (16U)
#define ABRQ1 (15U)
#define TERR1 (11U)
#define ALST1 (10U)
#define TXOK1 (9U)
#define RQCP1 (8U)
#define ABRQ0 (7U)
#define TERR0 (3U)
#define ALST0 (2U)
#define TXOK0 (1U)
#define RQCP0 (0U)

// Bit position of CAN_TIR register
#define STID (21U)
#define EXID (3U)
#define IDE (2U)
#define RTR (1U)
#define TXRQ (0U)

// Bit position of CAN_TDTxR register
#define TIME (16U)
#define TGT (8U)
#define DLC (0U)

// Bit position of CAN_IER register
#define TMEIE (0U)
#define FMPIE0 (1U)
#define FFIE0 (2U)
#define FOVIE0 (3U)
#define FMPIE1 (4U)
#define FFIE1 (5U)
#define FOVIE1 (6U)
#define EWGIE (8U)
#define EPVIE (9U)
#define BOFIE (10U)
#define LECIE (11U)
#define ERRIE (15U)
#define WKUIE (16U)
#define SLKIE (17U)

// Bit position of CAN_RF0R
#define RFOM0 (5U)
#define FOVR0 (4U)
#define FULL0 (3U)
#define FMP0 (0U)

// Bit position of CAN_RF01
#define RFOM1 (5U)
#define FOVR1 (4U)
#define FULL1 (3U)
#define FMP1 (0U)

// Bit position of CAN_ESR
#define EWGF (0U)
#define EPVF (1U)
#define BOFF (2U)
#define LEC (4U)
#define TEC (16U)
#define REC (24U)

// Bit position of CAN_RIR
#define STID_rx (21U)
#define EXID_rx (3U)
#define IDE_rx (2U)
#define RTR_rx (1U)

// Bit position of CAN_RDTR
#define TIME_rx (16U)
#define FMI_rx (8U)
#define DLC_rx (0U)

// Data_tx mask position
#define CAN_TDLR_DATA0_Pos 0
#define CAN_TDLR_DATA1_Pos 8
#define CAN_TDLR_DATA2_Pos 16
#define CAN_TDLR_DATA3_Pos 24
#define CAN_TDHR_DATA4_Pos 0
#define CAN_TDHR_DATA5_Pos 8
#define CAN_TDHR_DATA6_Pos 16
#define CAN_TDHR_DATA7_Pos 24

// Data_rx mask position
#define CAN_RDLR_DATA0_Pos 0
#define CAN_RDLR_DATA1_Pos 8
#define CAN_RDLR_DATA2_Pos 16
#define CAN_RDLR_DATA3_Pos 24
#define CAN_RDHR_DATA4_Pos 0
#define CAN_RDHR_DATA5_Pos 8
#define CAN_RDHR_DATA6_Pos 16
#define CAN_RDHR_DATA7_Pos 24

/**---------------------------------@defgroup-------------------------------------------------**/
/*@defgroup _CAN_operating_mode */
#define _CAN_MODE_NORMAL ((0 << SILM) | (0 << LBKM))          /*!< Normal mode   */
#define _CAN_MODE_LOOPBACK ((0 << SILM) | (1 << LBKM))        /*!< Loopback mode */
#define _CAN_MODE_SILENT ((1 << SILM) | (0 << LBKM))          /*!< Silent mode   */
#define _CAN_MODE_SILENT_LOOPBACK ((1 << SILM) | (1 << LBKM)) /*!< Loopback combined with silent mode   */

/*@defgroup _CAN_identifier_type */
#define _CAN_ID_STD (0U) /*!< Standard Id */
#define _CAN_ID_EXT (1U) /*!< Extended Id */

/*@defgroup _CAN_remote_transmission_request*/
#define _CAN_RTR_DATA (0UL)   /*!< Data frame   */
#define _CAN_RTR_REMOTE (1UL) /*!< Remote frame */

/*@defgroup _CAN_filter_FIFO*/
#define _CAN_FILTER_FIFO0 (0U) /*!< Filter FIFO 0 assignment for filter x */
#define _CAN_FILTER_FIFO1 (1U) /*!< Filter FIFO 1 assignment for filter x */

/*@defgroup _CAN_filter_mode*/
#define _CAN_FILTERMODE_IDMASK (0U) /*!< Identifier mask mode */
#define _CAN_FILTERMODE_IDLIST (1U) /*!< Identifier list mode */

/*@defgroup _CAN_filter_scale */
#define _CAN_FILTERSCALE_16BIT (0U) /*!< Two 16-bit filters */
#define _CAN_FILTERSCALE_32BIT (1U) /*!< One 32-bit filter  */

/** @defgroup _CAN_filter_activation CAN Filter Activation*/
#define _CAN_FILTER_DISABLE (0U) /*!< Disable filter */
#define _CAN_FILTER_ENABLE (1U)  /*!< Enable filter  */

/** @defgroup _CAN_synchronisation_jump_width*/
#define _CAN_SJW_1TQ (0U) /*!< 1 time quantum */
#define _CAN_SJW_2TQ (1U) /*!< 2 time quantum */
#define _CAN_SJW_3TQ (2U) /*!< 3 time quantum */
#define _CAN_SJW_4TQ (3U) /*!< 4 time quantum */

/** @defgroup _CAN_time_quantum_in_bit_segment_1*/
#define _CAN_BS1_1TQ (0U)   /*!< 1 time quantum  */
#define _CAN_BS1_2TQ (1U)   /*!< 2 time quantum  */
#define _CAN_BS1_3TQ (2U)   /*!< 3 time quantum  */
#define _CAN_BS1_4TQ (3U)   /*!< 4 time quantum  */
#define _CAN_BS1_5TQ (4U)   /*!< 5 time quantum  */
#define _CAN_BS1_6TQ (5U)   /*!< 6 time quantum  */
#define _CAN_BS1_7TQ (6U)   /*!< 7 time quantum  */
#define _CAN_BS1_8TQ (7U)   /*!< 8 time quantum  */
#define _CAN_BS1_9TQ (8U)   /*!< 9 time quantum  */
#define _CAN_BS1_10TQ (9U)  /*!< 10 time quantum */
#define _CAN_BS1_11TQ (10U) /*!< 11 time quantum */
#define _CAN_BS1_12TQ (11U) /*!< 12 time quantum */
#define _CAN_BS1_13TQ (12U) /*!< 13 time quantum */
#define _CAN_BS1_14TQ (13U) /*!< 14 time quantum */
#define _CAN_BS1_15TQ (14U) /*!< 15 time quantum */
#define _CAN_BS1_16TQ (15U) /*!< 16 time quantum */

/** @defgroup _CAN_time_quantum_in_bit_segment_2*/
#define _CAN_BS2_1TQ (0U) /*!< 1 time quantum */
#define _CAN_BS2_2TQ (1U) /*!< 2 time quantum */
#define _CAN_BS2_3TQ (2U) /*!< 3 time quantum */
#define _CAN_BS2_4TQ (3U) /*!< 4 time quantum */
#define _CAN_BS2_5TQ (4U) /*!< 5 time quantum */
#define _CAN_BS2_6TQ (5U) /*!< 6 time quantum */
#define _CAN_BS2_7TQ (6U) /*!< 7 time quantum */
#define _CAN_BS2_8TQ (7U) /*!< 8 time quantum */

