ryanjtr/STMF405_CAN_LL_LIB/can_ll_lib/stm32f4_can_ll.h
/** @defgroup _CAN_receive_FIFO_number*/
#define _CAN_RX_FIFO0 (0U) /*!< CAN receive FIFO 0 */
#define _CAN_RX_FIFO1 (1U) /*!< CAN receive FIFO 1 */

/** @defgroup _CAN_Interrupts */
/* Transmit Interrupt */
#define _CAN_IT_TX_MAILBOX_EMPTY_Pos (1U << 0U) /*!< Transmit mailbox empty interrupt */

/* Receive Interrupts */
#define _CAN_IT_RX_FIFO0_MSG_PENDING_Pos (1U << 1U) /*!< FIFO 0 message pending interrupt */
#define _CAN_IT_RX_FIFO0_FULL_Pos (1U << 2U)        /*!< FIFO 0 full interrupt            */
#define _CAN_IT_RX_FIFO0_OVERRUN_Pos (1U << 3U)     /*!< FIFO 0 overrun interrupt         */
#define _CAN_IT_RX_FIFO1_MSG_PENDING_Pos (1U << 4U) /*!< FIFO 1 message pending interrupt */
#define _CAN_IT_RX_FIFO1_FULL_Pos (1U << 5U)        /*!< FIFO 1 full interrupt            */
#define _CAN_IT_RX_FIFO1_OVERRUN_Pos (1U << 6U)     /*!< FIFO 1 overrun interrupt         */

/**---------------------------------Error Code-------------------------------------------------**/

#define LL_CAN_ERROR_NONE (0x00000000U)            /*!< No error                                             */
#define LL_CAN_ERROR_EWG (0x00000001U)             /*!< Protocol Error Warning                               */
#define LL_CAN_ERROR_EPV (0x00000002U)             /*!< Error Passive                                        */
#define LL_CAN_ERROR_BOF (0x00000004U)             /*!< Bus-off error                                        */
#define LL_CAN_ERROR_STF (0x00000008U)             /*!< Stuff error                                          */
#define LL_CAN_ERROR_FOR (0x00000010U)             /*!< Form error                                           */
#define LL_CAN_ERROR_ACK (0x00000020U)             /*!< Acknowledgment error                                 */
#define LL_CAN_ERROR_BR (0x00000040U)              /*!< Bit recessive error                                  */
#define LL_CAN_ERROR_BD (0x00000080U)              /*!< Bit dominant error                                   */
#define LL_CAN_ERROR_CRC (0x00000100U)             /*!< CRC error                                            */
#define LL_CAN_ERROR_RX_FOV0 (0x00000200U)         /*!< Rx FIFO0 overrun error                               */
#define LL_CAN_ERROR_RX_FOV1 (0x00000400U)         /*!< Rx FIFO1 overrun error                               */
#define LL_CAN_ERROR_TX_ALST0 (0x00000800U)        /*!< TxMailbox 0 transmit failure due to arbitration lost */
#define LL_CAN_ERROR_TX_TERR0 (0x00001000U)        /*!< TxMailbox 0 transmit failure due to transmit error   */
#define LL_CAN_ERROR_TX_ALST1 (0x00002000U)        /*!< TxMailbox 1 transmit failure due to arbitration lost */
#define LL_CAN_ERROR_TX_TERR1 (0x00004000U)        /*!< TxMailbox 1 transmit failure due to transmit error   */
#define LL_CAN_ERROR_TX_ALST2 (0x00008000U)        /*!< TxMailbox 2 transmit failure due to arbitration lost */
#define LL_CAN_ERROR_TX_TERR2 (0x00010000U)        /*!< TxMailbox 2 transmit failure due to transmit error   */
#define LL_CAN_ERROR_TIMEOUT (0x00020000U)         /*!< Timeout error                                        */
#define LL_CAN_ERROR_NOT_INITIALIZED (0x00040000U) /*!< Peripheral not initialized                           */
#define LL_CAN_ERROR_NOT_READY (0x00080000U)       /*!< Peripheral not ready                                 */
#define LL_CAN_ERROR_NOT_STARTED (0x00100000U)     /*!< Peripheral not started                               */
#define LL_CAN_ERROR_PARAM (0x00200000U)           /*!< Parameter error                                      */


/**---------------------------------APB1 clock for bit rate calculation---------------------------------**/

#define APB1_4MHZ 	4000000
#define APB1_8MHZ 	8000000
#define APB1_12MHZ 	12000000
#define APB1_24MHZ	24000000

/**---------------------------------Prototype functions-------------------------------------------------**/

ErrorStatus LL_CAN_GPIO_Init(LL_CAN_Handler_t *hcan);
ErrorStatus LL_CAN_Init(LL_CAN_Handler_t *hcan);
ErrorStatus LL_CAN_ConfigFilter(LL_CAN_Handler_t *hcan, LL_CAN_FilterTypeDef_t *hfilter);
ErrorStatus LL_CAN_AddTxMessage(LL_CAN_Handler_t *hcan, const uint8_t data[], LL_CAN_TxHeaderTypeDef_t *htxheader, uint32_t *TxMailBox);
ErrorStatus LL_CAN_IsTxMessagePending(LL_CAN_Handler_t *hcan, uint32_t *TxMailBox);
ErrorStatus LL_CAN_Start(LL_CAN_Handler_t *hcan);
void LL_CAN_ActivateInterrupt(LL_CAN_Handler_t *hcan, uint32_t ActiveITs);
ErrorStatus LL_CAN_GetRxMessage(LL_CAN_Handler_t *hcan, LL_CAN_RxHeaderTypeDef_t *hrxheader, uint8_t rxdata[], uint32_t RxFifo);
uint32_t LL_CAN_GetRxFifoFillLevel(LL_CAN_Handler_t *hcan, uint32_t RxFifo);
void LL_CAN_IRQHandler(LL_CAN_Handler_t *hcan);
/**---------------------------------Interrupt callback-------------------------------------------------**/
void LL_CAN_TxMailbox0CompleteCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_TxMailbox1CompleteCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_TxMailbox2CompleteCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_TxMailbox0AbortCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_TxMailbox1AbortCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_TxMailbox2AbortCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_RxFifo0MsgPendingCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_RxFifo0FullCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_RxFifo1MsgPendingCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_RxFifo1FullCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_SleepCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_WakeUpFromRxMsgCallback(LL_CAN_Handler_t *hcan);
void LL_CAN_ErrorCallback(LL_CAN_Handler_t *hcan);

#endif /* STM32F4_CAN_LL_H_ */
